Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFaceHole Properties
The FacetedBrepFaceHole type exposes the following members.
Properties
Name | Description
Count
 Gets the count;
IsReadOnly
 Gets a value indicating whether this instance is read only.
VerticeIndexes
 Gets the vertice indexes.
Vertices
 Gets the vertices.
Top
See Also
Reference
FacetedBrepFaceHole Class
Tekla.Structures.Geometry3d Namespace